In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [3]:
df1=pd.DataFrame(dict1)

In [4]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
df1.head()

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male

In [6]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [7]:
df1.tail(2)

      Name  Marks  Gender
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
df1.shape

(7, 3)

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [10]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [11]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [12]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [13]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [14]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [15]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [16]:
df1['Gender'].nunique()

2

In [17]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [18]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [19]:
sum(df1['Marks'].between(90,100))

4

In [20]:
df1['Marks'].mean()

92.14285714285714

In [21]:
df1['Marks'].max()

99

In [22]:
df1['Marks'].min()

83

In [23]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [24]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [25]:
df1.sort_values(by=['Marks'])

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [26]:
df1.sort_values(by=['Marks','Name'],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [27]:
df1[df1['Gender']=='Female']

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [28]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [29]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [30]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [31]:
df1

      Name  Marks  Gender  Male_Female
0  Priyang     98    Male            1
1   Aadhya     89  Female            0
2   Krisha     99  Female            0
3   Vedant     87    Male            1
4   Parshv     90    Male            1
5   Mittal     83  Female            0
6  Archana     99  Female            0

In [32]:
def marks(x):
    return x/2

In [33]:
df1['Half_Marks']=df1['Marks'].apply(marks)

In [34]:
df1

      Name  Marks  Gender  Male_Female  Half_Marks
0  Priyang     98    Male            1        49.0
1   Aadhya     89  Female            0        44.5
2   Krisha     99  Female            0        49.5
3   Vedant     87    Male            1        43.5
4   Parshv     90    Male            1        45.0
5   Mittal     83  Female            0        41.5
6  Archana     99  Female            0        49.5

In [35]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [36]:
df1['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [37]:
df1

      Name  Marks  Gender  Male_Female  Half_Marks
0  Priyang     98    Male            1        49.0
1   Aadhya     89  Female            0        44.5
2   Krisha     99  Female            0        49.5
3   Vedant     87    Male            1        43.5
4   Parshv     90    Male            1        45.0
5   Mittal     83  Female            0        41.5
6  Archana     99  Female            0        49.5

In [38]:
df1.drop(['Male_Female','Half_Marks'],axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female